getListData = {
              id: "8e9638c4-95c5-11ea-ad7f-025dc9746a68",
              type: "mediascreening",
              create_user_id: null,
              create_time: "2020-05-14T17:30:32+0800",
              metadata: {
                  filter: "text",
                  description: "泉州酒店倒塌.txt",
                  source: "http://mediascreening-beijing.oss-cn-beijing.aliyuncs.com/INPUT%2FDIR4%2F%E6%B3%89%E5%B7%9E%E9%85%92%E5%BA%97%E5%80%92%E5%A1%8C.txt",
                  state: "manual_audit",
                  poster: "",
                  audit_step_no: "1",
                  status: ""
              },
              step: [
                  {
                      no: "1",
                      name: "machine_audit",
                      status: "deprecated",
                      audit_time: "2020-05-14T17:30:48+0800",
                      audit_user_id: null,
                      reason: {
                          metadata_text: {
                              results: [
                                  {
                                      label: "politics",
                                      rate: 99.91,
                                      scene: "antispam",
                                      suggestion: "block"
                                  }
                              ]
                          }
                      },
                      detail: {
                          "8e9638c4-95c5-11ea-ad7f-025dc9746a68": {
                              metadata_text: {
                                  code: 200,
                                  data: [
                                      {
                                          code: 200,
                                          content: "[\"原标题：\\r\",\"福建省委省政府召开省市县三级视频会议：\\r\",\"全力救援救治彻底查清原因依法追究责任深刻汲取教训来源：\\r\",\"闽南网全力救援救治彻底查清原因依法追究责任深刻汲取教训省委省政府召开省市县视频会议部署全力做好泉州市欣佳酒店“3·7”房屋坍塌事故救援救治工作，\\r\",\"彻底查清事故原因，\\r\",\"依法严肃追究责任，\\r\",\"切实做好安全生产和安全隐患大排查大整治9日，\\r\",\"省委省政府召开省市县三级视频会议。\\r\",\"各设区市（实验区）和各县（市、\\r\",\"区）党政主要负责人，\\r\",\"分管安全生产、\\r\",\"复工复产、\\r\",\"建设的负责同志及各相关部门主要负责同志参加会议。\\r\",\"省委书记于伟国主持会议并强调要穷尽一切手段搜救失联者，\\r\",\"只要有一丝希望就必须作出百倍努力；要彻底查清事故原因，\\r\",\"不论涉及到谁，\\r\",\"都要依法依规严肃追究责任，\\r\",\"给人民群众一个负责任的交代；要深刻汲取血的教训，\\r\",\"全面开展安全生产和安全隐患大排查大整治，\\r\",\"切实维护人民群众生命财产安全。\\r\",\"省长唐登杰就做好安全生产和安全隐患排查提出具体要求。\\r\",\"与会同志对事故遇难者表示沉痛悼念，\\r\",\"向事故受伤人员和伤亡人员家属表示诚挚慰问。\\r\",\"会议指出泉州市欣佳酒店“3·7”房屋坍塌事故，\\r\",\"造成重大人员伤亡，\\r\",\"影响十分恶劣、\\r\",\"教训极其深刻。\\r\",\"事故发生后，\\r\",\"党中央、\\r\",\"国务院高度重视、\\r\",\"提出重要要求，\\r\",\"国务院安委会办公室派出应急部与住建部联合工作组到现场直接指导救援工作，\\r\",\"应急部全程连线指挥，\\r\",\"国家卫健委派出专家组指导伤员救治。\\r\",\"我省迅速调集消防、\\r\",\"武警、\\r\",\"医疗等救援力量，\\r\",\"千方百计救援救治。\\r\",\"1000多名来自泉州和全省各地的消防官兵等救援人员，\\r\",\"争分夺秒、\\r\",\"连续奋战。\\r\",\"会议强调▶要深入学习贯彻习近平总书记关于安全生产的重要论述，\\r\",\"深刻汲取血的教训，\\r\",\"以对人民群众极端负责的精神，\\r\",\"全力抓好救援救治和全省安全生产工作。\\r\",\"▶要继续争分夺秒、\\r\",\"科学精准、\\r\",\"安全高效开展救援，\\r\",\"在确保不对埋压人员造成二次伤害情况下，\\r\",\"由局部到逐层剥离楼板，\\r\",\"全面深入搜救，\\r\",\"只要有一丝挽救生命的希望就必须作出百倍努力。\\r\",\"▶要集中最顶尖专家、\\r\",\"调配最优质资源，\\r\",\"一人一案，\\r\",\"全力救治伤员。\\r\",\"▶要统筹做好救援救治和疫情防控工作，\\r\",\"防范次生灾害。\\r\",\"▶要妥善处理善后事宜，\\r\",\"及时回应社会关切。\\r\",\"会议强调要全面深入开展调查，\\r\",\"彻底查清事故原因，\\r\",\"并查明事故背后的所有违纪违法行为，\\r\",\"不论涉及到谁都要一查到底，\\r\",\"绝不袒护姑息，\\r\",\"坚决依法依规严肃追究责任、\\r\",\"严厉惩处，\\r\",\"给人民群众一个负责任的交代。\\r\",\"会议强调安全隐患是随时可能爆炸的“炸弹”，\\r\",\"将会对人民群众生命财产造成重大损失，\\r\",\"决不能有任何侥幸麻痹心理，\\r\",\"必须全面彻底排查。\\r\",\"▶要立即开展涉疫场所的安全隐患大排查，\\r\",\"确保隔离场所、\\r\",\"定点医院等安全万无一失。\\r\",\"要紧盯房屋特别是农村建房安全的突出问题，\\r\",\"全面彻底排查“四无”等各种违建问题，\\r\",\"严格进行处置。\\r\",\"▶要完善管理机制，\\r\",\"强化规划、\\r\",\"审批、\\r\",\"建设的管理，\\r\",\"严格管理民房出租和经营，\\r\",\"持续进行“两违”专项治理，\\r\",\"坚决依法处理房屋建设中的各种违法违规行为，\\r\",\"全力消除安全隐患。\\r\",\"会议强调要举一反三、\\r\",\"堵塞漏洞，\\r\",\"全面抓好安全生产和安全隐患排查整治。\\r\",\"牢牢紧盯事故多发易发的重点行业、\\r\",\"重点领域、\\r\",\"重点企业，\\r\",\"深入开展排查，\\r\",\"决不放过任何一个漏洞、\\r\",\"任何一个盲点、\\r\",\"任何一个隐患，\\r\",\"确保复工复产安全有序，\\r\",\"持续深化危险化学品、\\r\",\"道路运输、\\r\",\"消防、\\r\",\"矿山和公共安全等各方面安全整治，\\r\",\"切实维护人民群众生命财产安全和社会和谐稳定。\\r\",\"会议要求要压紧压实各地党委和政府安全生产属地责任，\\r\",\"全面落实部门监管责任和企业主体责任，\\r\",\"严肃追责问责，\\r\",\"确保安全生产各项工作抓实抓细抓到位。\\r\",\"省领导王宁、\\r\",\"张志南、\\r\",\"胡昌升、\\r\",\"刘学新、\\r\",\"杨贤金、\\r\",\"郑新聪、\\r\",\"梁建勇、\\r\",\"李德金、\\r\",\"田湘利、\\r\",\"郑建闽、\\r\",\"郭宁宁、\\r\",\"林宝金、\\r\",\"林钟乐参加会议。\\r\",\"来源：\\r\"]",
                                          dataId: "97237614-95c5-11ea-a413-025dc9f24045",
                                          msg: "OK",
                                          results: [
                                              {
                                                  details: [
                                                      {
                                                          contexts: [
                                                              {
                                                                  context: "贯彻习近平总书记关于安"
                                                              },
                                                              {
                                                                  context: "深刻汲取血的教训"
                                                              },
                                                              {
                                                                  context: "百倍努力"
                                                              },
                                                              {
                                                                  context: "严格进行处置"
                                                              }
                                                          ],
                                                          label: "politics"
                                                      }
                                                  ],
                                                  label: "porn",
                                                  rate: 99.91,
                                                  scene: "antispam",
                                                  suggestion: "review"
                                              }
                                          ],
                                          taskId: "txt4LTrS1V3Xvy7sLEyQYxS7$-1sxa8P"
                                      }, {
                                          code: 200,
                                          content: "[\"原标题：\\r\",\"福建省委省政府召开省市县三级视频会议：\\r\",\"全力救援救治彻底查清原因依法追究责任深刻汲取教训来源：\\r\",\"闽南网全力救援救治彻底查清原因依法追究责任深刻汲取教训省委省政府召开省市县视频会议部署全力做好泉州市欣佳酒店“3·7”房屋坍塌事故救援救治工作，\\r\",\"彻底查清事故原因，\\r\",\"依法严肃追究责任，\\r\",\"切实做好安全生产和安全隐患大排查大整治9日，\\r\",\"省委省政府召开省市县三级视频会议。\\r\",\"各设区市（实验区）和各县（市、\\r\",\"区）党政主要负责人，\\r\",\"分管安全生产、\\r\",\"复工复产、\\r\",\"建设的负责同志及各相关部门主要负责同志参加会议。\\r\",\"省委书记于伟国主持会议并强调要穷尽一切手段搜救失联者，\\r\",\"只要有一丝希望就必须作出百倍努力；要彻底查清事故原因，\\r\",\"不论涉及到谁，\\r\",\"都要依法依规严肃追究责任，\\r\",\"给人民群众一个负责任的交代；要深刻汲取血的教训，\\r\",\"全面开展安全生产和安全隐患大排查大整治，\\r\",\"切实维护人民群众生命财产安全。\\r\",\"省长唐登杰就做好安全生产和安全隐患排查提出具体要求。\\r\",\"与会同志对事故遇难者表示沉痛悼念，\\r\",\"向事故受伤人员和伤亡人员家属表示诚挚慰问。\\r\",\"会议指出泉州市欣佳酒店“3·7”房屋坍塌事故，\\r\",\"造成重大人员伤亡，\\r\",\"影响十分恶劣、\\r\",\"教训极其深刻。\\r\",\"事故发生后，\\r\",\"党中央、\\r\",\"国务院高度重视、\\r\",\"提出重要要求，\\r\",\"国务院安委会办公室派出应急部与住建部联合工作组到现场直接指导救援工作，\\r\",\"应急部全程连线指挥，\\r\",\"国家卫健委派出专家组指导伤员救治。\\r\",\"我省迅速调集消防、\\r\",\"武警、\\r\",\"医疗等救援力量，\\r\",\"千方百计救援救治。\\r\",\"1000多名来自泉州和全省各地的消防官兵等救援人员，\\r\",\"争分夺秒、\\r\",\"连续奋战。\\r\",\"会议强调▶要深入学习贯彻习近平总书记关于安全生产的重要论述，\\r\",\"深刻汲取血的教训，\\r\",\"以对人民群众极端负责的精神，\\r\",\"全力抓好救援救治和全省安全生产工作。\\r\",\"▶要继续争分夺秒、\\r\",\"科学精准、\\r\",\"安全高效开展救援，\\r\",\"在确保不对埋压人员造成二次伤害情况下，\\r\",\"由局部到逐层剥离楼板，\\r\",\"全面深入搜救，\\r\",\"只要有一丝挽救生命的希望就必须作出百倍努力。\\r\",\"▶要集中最顶尖专家、\\r\",\"调配最优质资源，\\r\",\"一人一案，\\r\",\"全力救治伤员。\\r\",\"▶要统筹做好救援救治和疫情防控工作，\\r\",\"防范次生灾害。\\r\",\"▶要妥善处理善后事宜，\\r\",\"及时回应社会关切。\\r\",\"会议强调要全面深入开展调查，\\r\",\"彻底查清事故原因，\\r\",\"并查明事故背后的所有违纪违法行为，\\r\",\"不论涉及到谁都要一查到底，\\r\",\"绝不袒护姑息，\\r\",\"坚决依法依规严肃追究责任、\\r\",\"严厉惩处，\\r\",\"给人民群众一个负责任的交代。\\r\",\"会议强调安全隐患是随时可能爆炸的“炸弹”，\\r\",\"将会对人民群众生命财产造成重大损失，\\r\",\"决不能有任何侥幸麻痹心理，\\r\",\"必须全面彻底排查。\\r\",\"▶要立即开展涉疫场所的安全隐患大排查，\\r\",\"确保隔离场所、\\r\",\"定点医院等安全万无一失。\\r\",\"要紧盯房屋特别是农村建房安全的突出问题，\\r\",\"全面彻底排查“四无”等各种违建问题，\\r\",\"严格进行处置。\\r\",\"▶要完善管理机制，\\r\",\"强化规划、\\r\",\"审批、\\r\",\"建设的管理，\\r\",\"严格管理民房出租和经营，\\r\",\"持续进行“两违”专项治理，\\r\",\"坚决依法处理房屋建设中的各种违法违规行为，\\r\",\"全力消除安全隐患。\\r\",\"会议强调要举一反三、\\r\",\"堵塞漏洞，\\r\",\"全面抓好安全生产和安全隐患排查整治。\\r\",\"牢牢紧盯事故多发易发的重点行业、\\r\",\"重点领域、\\r\",\"重点企业，\\r\",\"深入开展排查，\\r\",\"决不放过任何一个漏洞、\\r\",\"任何一个盲点、\\r\",\"任何一个隐患，\\r\",\"确保复工复产安全有序，\\r\",\"持续深化危险化学品、\\r\",\"道路运输、\\r\",\"消防、\\r\",\"矿山和公共安全等各方面安全整治，\\r\",\"切实维护人民群众生命财产安全和社会和谐稳定。\\r\",\"会议要求要压紧压实各地党委和政府安全生产属地责任，\\r\",\"全面落实部门监管责任和企业主体责任，\\r\",\"严肃追责问责，\\r\",\"确保安全生产各项工作抓实抓细抓到位。\\r\",\"省领导王宁、\\r\",\"张志南、\\r\",\"胡昌升、\\r\",\"刘学新、\\r\",\"杨贤金、\\r\",\"郑新聪、\\r\",\"梁建勇、\\r\",\"李德金、\\r\",\"田湘利、\\r\",\"郑建闽、\\r\",\"郭宁宁、\\r\",\"林宝金、\\r\",\"林钟乐参加会议。\\r\",\"来源：\\r\"]",
                                          dataId: "97237614-95c5-11ea-a413-025dc9f24045",
                                          msg: "OK",
                                          results: [
                                              {
                                                  details: [
                                                      {
                                                          contexts: [
                                                              {
                                                                  context: "贯彻习近平总书记关于安"
                                                              },
                                                              {
                                                                  context: "深刻汲取血的教训"
                                                              },
                                                              {
                                                                  context: "百倍努力"
                                                              },
                                                              {
                                                                  context: "严格进行处置"
                                                              }
                                                          ],
                                                          label: "politics"
                                                      }
                                                  ],
                                                  label: "politics",
                                                  rate: 99.91,
                                                  scene: "antispam",
                                                  suggestion: "block"
                                              }
                                          ],
                                          taskId: "txt4LTrS1V3Xvy7sLEyQYxS7$-1sxa8P"
                                      }, {
                                          code: 200,
                                          content: "[\"原标题：\\r\",\"福建省委省政府召开省市县三级视频会议：\\r\",\"全力救援救治彻底查清原因依法追究责任深刻汲取教训来源：\\r\",\"闽南网全力救援救治彻底查清原因依法追究责任深刻汲取教训省委省政府召开省市县视频会议部署全力做好泉州市欣佳酒店“3·7”房屋坍塌事故救援救治工作，\\r\",\"彻底查清事故原因，\\r\",\"依法严肃追究责任，\\r\",\"切实做好安全生产和安全隐患大排查大整治9日，\\r\",\"省委省政府召开省市县三级视频会议。\\r\",\"各设区市（实验区）和各县（市、\\r\",\"区）党政主要负责人，\\r\",\"分管安全生产、\\r\",\"复工复产、\\r\",\"建设的负责同志及各相关部门主要负责同志参加会议。\\r\",\"省委书记于伟国主持会议并强调要穷尽一切手段搜救失联者，\\r\",\"只要有一丝希望就必须作出百倍努力；要彻底查清事故原因，\\r\",\"不论涉及到谁，\\r\",\"都要依法依规严肃追究责任，\\r\",\"给人民群众一个负责任的交代；要深刻汲取血的教训，\\r\",\"全面开展安全生产和安全隐患大排查大整治，\\r\",\"切实维护人民群众生命财产安全。\\r\",\"省长唐登杰就做好安全生产和安全隐患排查提出具体要求。\\r\",\"与会同志对事故遇难者表示沉痛悼念，\\r\",\"向事故受伤人员和伤亡人员家属表示诚挚慰问。\\r\",\"会议指出泉州市欣佳酒店“3·7”房屋坍塌事故，\\r\",\"造成重大人员伤亡，\\r\",\"影响十分恶劣、\\r\",\"教训极其深刻。\\r\",\"事故发生后，\\r\",\"党中央、\\r\",\"国务院高度重视、\\r\",\"提出重要要求，\\r\",\"国务院安委会办公室派出应急部与住建部联合工作组到现场直接指导救援工作，\\r\",\"应急部全程连线指挥，\\r\",\"国家卫健委派出专家组指导伤员救治。\\r\",\"我省迅速调集消防、\\r\",\"武警、\\r\",\"医疗等救援力量，\\r\",\"千方百计救援救治。\\r\",\"1000多名来自泉州和全省各地的消防官兵等救援人员，\\r\",\"争分夺秒、\\r\",\"连续奋战。\\r\",\"会议强调▶要深入学习贯彻习近平总书记关于安全生产的重要论述，\\r\",\"深刻汲取血的教训，\\r\",\"以对人民群众极端负责的精神，\\r\",\"全力抓好救援救治和全省安全生产工作。\\r\",\"▶要继续争分夺秒、\\r\",\"科学精准、\\r\",\"安全高效开展救援，\\r\",\"在确保不对埋压人员造成二次伤害情况下，\\r\",\"由局部到逐层剥离楼板，\\r\",\"全面深入搜救，\\r\",\"只要有一丝挽救生命的希望就必须作出百倍努力。\\r\",\"▶要集中最顶尖专家、\\r\",\"调配最优质资源，\\r\",\"一人一案，\\r\",\"全力救治伤员。\\r\",\"▶要统筹做好救援救治和疫情防控工作，\\r\",\"防范次生灾害。\\r\",\"▶要妥善处理善后事宜，\\r\",\"及时回应社会关切。\\r\",\"会议强调要全面深入开展调查，\\r\",\"彻底查清事故原因，\\r\",\"并查明事故背后的所有违纪违法行为，\\r\",\"不论涉及到谁都要一查到底，\\r\",\"绝不袒护姑息，\\r\",\"坚决依法依规严肃追究责任、\\r\",\"严厉惩处，\\r\",\"给人民群众一个负责任的交代。\\r\",\"会议强调安全隐患是随时可能爆炸的“炸弹”，\\r\",\"将会对人民群众生命财产造成重大损失，\\r\",\"决不能有任何侥幸麻痹心理，\\r\",\"必须全面彻底排查。\\r\",\"▶要立即开展涉疫场所的安全隐患大排查，\\r\",\"确保隔离场所、\\r\",\"定点医院等安全万无一失。\\r\",\"要紧盯房屋特别是农村建房安全的突出问题，\\r\",\"全面彻底排查“四无”等各种违建问题，\\r\",\"严格进行处置。\\r\",\"▶要完善管理机制，\\r\",\"强化规划、\\r\",\"审批、\\r\",\"建设的管理，\\r\",\"严格管理民房出租和经营，\\r\",\"持续进行“两违”专项治理，\\r\",\"坚决依法处理房屋建设中的各种违法违规行为，\\r\",\"全力消除安全隐患。\\r\",\"会议强调要举一反三、\\r\",\"堵塞漏洞，\\r\",\"全面抓好安全生产和安全隐患排查整治。\\r\",\"牢牢紧盯事故多发易发的重点行业、\\r\",\"重点领域、\\r\",\"重点企业，\\r\",\"深入开展排查，\\r\",\"决不放过任何一个漏洞、\\r\",\"任何一个盲点、\\r\",\"任何一个隐患，\\r\",\"确保复工复产安全有序，\\r\",\"持续深化危险化学品、\\r\",\"道路运输、\\r\",\"消防、\\r\",\"矿山和公共安全等各方面安全整治，\\r\",\"切实维护人民群众生命财产安全和社会和谐稳定。\\r\",\"会议要求要压紧压实各地党委和政府安全生产属地责任，\\r\",\"全面落实部门监管责任和企业主体责任，\\r\",\"严肃追责问责，\\r\",\"确保安全生产各项工作抓实抓细抓到位。\\r\",\"省领导王宁、\\r\",\"张志南、\\r\",\"胡昌升、\\r\",\"刘学新、\\r\",\"杨贤金、\\r\",\"郑新聪、\\r\",\"梁建勇、\\r\",\"李德金、\\r\",\"田湘利、\\r\",\"郑建闽、\\r\",\"郭宁宁、\\r\",\"林宝金、\\r\",\"林钟乐参加会议。\\r\",\"来源：\\r\"]",
                                          dataId: "97237614-95c5-11ea-a413-025dc9f24045",
                                          msg: "OK",
                                          results: [
                                              {
                                                  details: [
                                                      {
                                                          contexts: [
                                                              {
                                                                  context: "贯彻习近平总书记关于安"
                                                              },
                                                              {
                                                                  context: "深刻汲取血的教训"
                                                              },
                                                              {
                                                                  context: "百倍努力"
                                                              },
                                                              {
                                                                  context: "严格进行处置"
                                                              }
                                                          ],
                                                          label: "politics"
                                                      }
                                                  ],
                                                  label: "politics",
                                                  rate: 99.91,
                                                  scene: "antispam",
                                                  suggestion: "pass"
                                              }
                                          ],
                                          taskId: "txt4LTrS1V3Xvy7sLEyQYxS7$-1sxa8P"
                                      }
                                  ],
                                  msg: "OK",
                                  requestId: "68DA690F-D673-45D7-8CFA-B1F3DCAA5BCD"
                              }
                          }
                      }
                  },
                  {
                      no: "2",
                      name: "manual_audit",
                      status: "prepare_audit",
                      audit_time: null,
                      audit_user_id: null,
                      reason: null,
                      detail: null
                  }
              ],
              step_Map: {
                  1: "deprecated",
                  2: "prepare_audit"
              }
          };